[
    {"title": "The Shawshank Redemption", "description": "Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency.", "release_date": "1994-09-22", "duration": "2:22:00", "country": "United States"},
    {"title": "The Godfather", "description": "The aging patriarch of an organized crime dynasty transfers control of his clandestine empire to his reluctant son.", "release_date": "1972-03-24", "duration": "2:55:00", "country": "United States"},
    {"title": "The Dark Knight", "description": "When the menace known as the Joker emerges from his mysterious past, he wreaks havoc and chaos on the people of Gotham.", "release_date": "2008-07-18", "duration": "2:32:00", "country": "United States"},
    {"title": "Pulp Fiction", "description": "The lives of two mob hitmen, a boxer, a gangster's wife, and a pair of diner bandits intertwine in four tales of violence and redemption.", "release_date": "1994-10-14", "duration": "2:34:00", "country": "United States"},
    {"title": "The Lord of the Rings: The Return of the King", "description": "Gandalf and Aragorn lead the world of Men against Sauron's army to draw his gaze from Frodo and Sam as they approach Mount Doom with the One Ring.", "release_date": "2003-12-17", "duration": "3:21:00", "country": "United States"},
    {"title": "Forrest Gump", "description": "The presidencies of Kennedy and Johnson, the Vietnam War, the Watergate scandal and other historical events unfold from the perspective of an Alabama man with an IQ of 75.", "release_date": "1994-07-06", "duration": "2:22:00", "country": "United States"},
    {"title": "Inception", "description": "A thief who enters the dreams of others to steal secrets from their subconscious is given a chance to have his criminal history erased as payment for the implantation of another person's idea into a target's subconscious.", "release_date": "2010-07-16", "duration": "2:28:00", "country": "United States"},
    {"title": "The Matrix", "description": "A computer hacker learns from mysterious rebels about the true nature of his reality and his role in the war against its controllers.", "release_date": "1999-03-31", "duration": "2:16:00", "country": "United States"},
    {"title": "Goodfellas", "description": "The story of Henry Hill and his life in the mob, covering his relationship with his wife Karen Hill and his mob partners Jimmy Conway and Tommy DeVito.", "release_date": "1990-09-19", "duration": "2:26:00", "country": "United States"},
    {"title": "Fight Club", "description": "An insomniac office worker and a soap salesman build a global organization to help vent male aggression.", "release_date": "1999-10-15", "duration": "2:19:00", "country": "United States"},
    {"title": "The Lord of the Rings: The Fellowship of the Ring", "description": "A meek hobbit from the Shire and eight companions set out on a journey to destroy the powerful One Ring and save Middle-earth from the Dark Lord Sauron.", "release_date": "2001-12-19", "duration": "2:58:00", "country": "United States"},
    {"title": "The Lord of the Rings: The Two Towers", "description": "While Frodo and Sam try to destroy the One Ring in Mount Doom, Aragorn, Gandalf, and Legolas help the people of Rohan defend their kingdom from the evil Saruman and his army.", "release_date": "2002-12-18", "duration": "2:59:00", "country": "United States"},
    {"title": "Gladiator", "description": "A former Roman General sets out to exact vengeance against the corrupt emperor who murdered his family and sent him into slavery.", "release_date": "2000-05-05", "duration": "2:35:00", "country": "United States"},
    {"title": "The Silence of the Lambs", "description": "A young FBI cadet must confide in an incarcerated and manipulative killer to receive his help on catching another serial killer who skins his victims.", "release_date": "1991-02-14", "duration": "1:58:00", "country": "United States"},
    {"title": "City of God", "description": "In the slums of Rio, two kids' paths diverge as one struggles to become a photographer and the other a kingpin.", "release_date": "2002-02-05", "duration": "2:10:00", "country": "Brazil"},
    {"title": "Se7en", "description": "Two detectives, a rookie and a veteran, hunt a serial killer who uses the seven deadly sins as his modus operandi.", "release_date": "1995-09-22", "duration": "2:07:00", "country": "United States"},
    {"title": "The Usual Suspects", "description": "A sole survivor tells the police the story of how he came to be in the middle of a gun battle between the police and a gang of criminals.", "release_date": "1995-08-16", "duration": "1:46:00", "country": "United States"},
    {"title": "The Green Mile", "description": "The lives of guards on Death Row are affected by one of their charges: a black man accused of murder who has a mysterious gift.", "release_date": "1999-12-10", "duration": "3:09:00", "country": "United States"},
    {"title": "Léon: The Professional", "description": "A professional assassin rescues a young girl whose parents were killed in front of her. As the girl grows up, she becomes an apprentice to the assassin.", "release_date": "1994-11-18", "duration": "1:50:00", "country": "France"},
    {"title": "American History X", "description": "A former neo-nazi skinhead tries to prevent his younger brother from going down the same wrong path that he did.", "release_date": "1998-10-30", "duration": "1:59:00", "country": "United States"},
    {"title": "Spirited Away", "description": "During her family's move to the suburbs, a 10-year-old girl wanders into a mysterious world where she must save her parents and return home.", "release_date": "2001-07-20", "duration": "2:05:00", "country": "Japan"},
    {"title": "Saving Private Ryan", "description": "Following the Normandy landings, a group of U.S. soldiers goes behind enemy lines to retrieve a paratrooper whose brothers have been killed in action.", "release_date": "1998-07-24", "duration": "2:49:00", "country": "United States"},
    {"title": "The Lion King", "description": "Lion prince Simba and his father are targeted by his bitter uncle, who wants to ascend the throne himself.", "release_date": "1994-06-24", "duration": "1:28:00", "country": "United States"},
    {"title": "Back to the Future", "description": "A teenager is sent 30 years into the past in a time-traveling DeLorean invented by his close friend, a scientist, and must ensure his parents fall in love or risk altering the future.", "release_date": "1985-07-03", "duration": "1:56:00", "country": "United States"},
    {"title": "Terminator 2: Judgment Day", "description": "A cyborg, identical to the one who failed to kill Sarah Connor, must now protect her teenage son from a more advanced and powerful cyborg.", "release_date": "1991-07-03", "duration": "2:17:00", "country": "United States"},
    {"title": "The Departed", "description": "An undercover cop and a mole in the police attempt to identify each other while infiltrating an Irish gang in Boston.", "release_date": "2006-10-06", "duration": "2:31:00", "country": "United States"},
    {"title": "The Prestige", "description": "Two stage magicians engage in competitive one-upmanship in an attempt to create the ultimate stage illusion.", "release_date": "2006-10-20", "duration": "2:10:00", "country": "United States"},
    {"title": "Interstellar", "description": "A team of explorers travel through a wormhole in space in an attempt to ensure humanity's survival.", "release_date": "2014-11-07", "duration": "2:49:00", "country": "United States"},
    {"title": "The Intouchables", "description": "After he becomes a quadriplegic from a paragliding accident, an aristocrat hires a young man from the projects to be his caregiver.", "release_date": "2011-11-02", "duration": "1:52:00", "country": "France"},
    {"title": "Whiplash", "description": "A promising young drummer enrolls at a cutthroat music conservatory where his dreams of greatness are threatened by a ruthless instructor.", "release_date": "2014-10-10", "duration": "1:47:00", "country": "United States"},
    {"title": "Parasite", "description": "Greed and class discrimination threaten the newly formed symbiotic relationship between the wealthy Park family and the destitute Kim clan.", "release_date": "2019-05-30", "duration": "2:12:00", "country": "South Korea"},
    {"title": "Joker", "description": "In Gotham City, mentally troubled comedian Arthur Fleck is disregarded and mistreated by society. He begins a slow descent into insanity as he adopts the iconic persona of the Joker.", "release_date": "2019-10-04", "duration": "2:02:00", "country": "United States"},
    {"title": "The Grand Budapest Hotel", "description": "A hotel concierge and his protégé become involved in the theft and recovery of a priceless Renaissance painting and the battle for an enormous family fortune.", "release_date": "2014-03-28", "duration": "1:39:00", "country": "United States"},
    {"title": "Memento", "description": "A man with short-term memory loss uses notes and tattoos to hunt for the man he thinks is responsible for his wife's murder.", "release_date": "2001-10-11", "duration": "1:53:00", "country": "United States"},
    {"title": "The Big Lebowski", "description": "Jeff Lebowski, whose nickname is The Dude, is mistaken for a millionaire Lebowski and becomes embroiled in a complex kidnapping case.", "release_date": "1998-03-06", "duration": "1:57:00", "country": "United States"},
    {"title": "Django Unchained", "description": "With the help of a German bounty hunter, a freed slave sets out to rescue his wife from a brutal Mississippi plantation owner.", "release_date": "2012-12-25", "duration": "2:45:00", "country": "United States"},
    {"title": "The Revenant", "description": "In the 1820s, a frontiersman on a quest for survival seeks revenge against those who left him for dead.", "release_date": "2015-12-25", "duration": "2:36:00", "country": "United States"},
    {"title": "Her", "description": "A lonely writer develops an unlikely relationship with an operating system designed to meet his every need.", "release_date": "2013-12-18", "duration": "2:06:00", "country": "United States"},
    {"title": "A Beautiful Mind", "description": "The true story of John Nash, a brilliant but asocial mathematician, and his struggle with schizophrenia.", "release_date": "2001-12-21", "duration": "2:15:00", "country": "United States"},
    {"title": "The Shining", "description": "A family heads to an isolated hotel for the winter where a sinister presence influences the father into violence, while his psychic son sees horrific forebodings from both past and future.", "release_date": "1980-05-23", "duration": "2:26:00", "country": "United States"},
    {"title": "The Breakfast Club", "description": "Five high school students from different backgrounds spend a Saturday in detention together and come to understand each other better.", "release_date": "1985-02-15", "duration": "1:37:00", "country": "United States"},
    {"title": "The Truman Show", "description": "An insurance salesman discovers his entire life is a reality TV show broadcast to millions of viewers.", "release_date": "1998-06-05", "duration": "1:43:00", "country": "United States"},
    {"title": "The Hunt for Red October", "description": "In 1984, an international political thriller involving a Soviet submarine and an American naval officer.", "release_date": "1990-03-02", "duration": "2:15:00", "country": "United States"},
    {"title": "Donnie Darko", "description": "A troubled teenager is plagued by visions of a man in a rabbit suit who manipulates him to commit a series of crimes.", "release_date": "2001-10-26", "duration": "1:53:00", "country": "United States"},
    {"title": "Once Upon a Time in the West", "description": "A mysterious stranger with a harmonica joins forces with a notorious outlaw to protect a woman from a ruthless assassin.", "release_date": "1968-12-21", "duration": "2:45:00", "country": "Italy"},
    {"title": "The Good, the Bad and the Ugly", "description": "A bounty hunting scam joins two men in an uneasy alliance against a third in a race to find a fortune in gold buried in a remote cemetery.", "release_date": "1966-12-23", "duration": "2:58:00", "country": "Italy"},
    {"title": "The Great Dictator", "description": "In this satire, a Jewish barber who looks just like the dictator of a fascist regime becomes the unlikely hero who fights for freedom and justice.", "release_date": "1940-10-15", "duration": "2:05:00", "country": "United States"},
    {"title": "Cinema Paradiso", "description": "A filmmaker recalls his childhood when he fell in love with the movies at his village's theater and formed a deep bond with its projectionist.", "release_date": "1988-11-17", "duration": "2:35:00", "country": "Italy"},
    {"title": "Pan's Labyrinth", "description": "In post-Civil War Spain, a young girl discovers a mysterious labyrinth and encounters a faun who tells her she is the reincarnation of a lost princess.", "release_date": "2006-10-11", "duration": "1:59:00", "country": "Mexico"},
    {"title": "The Seventh Seal", "description": "A medieval knight returns from the Crusades and challenges Death to a game of chess to delay his fate and find meaning in life.", "release_date": "1957-02-19", "duration": "1:96:00", "country": "Sweden"},
    {"title": "The Lives of Others", "description": "In East Berlin before the fall of the Berlin Wall, a Stasi officer is assigned to spy on a playwright and becomes increasingly involved in the lives of those he is monitoring.", "release_date": "2006-03-09", "duration": "2:17:00", "country": "Germany"},
    {"title": "Raging Bull", "description": "The life of boxer Jake LaMotta, whose violence and temper led him to the top of the ring, and ultimately destroyed his life outside of it.", "release_date": "1980-11-14", "duration": "2:09:00", "country": "United States"},
    {"title": "Amélie", "description": "A shy waitress in Paris decides to improve the lives of those around her while grappling with her own isolated existence.", "release_date": "2001-04-25", "duration": "2:02:00", "country": "France"},
    {"title": "Life of Pi", "description": "A young man who survives a disaster at sea is hurtled into an epic journey of adventure and discovery while stranded on a lifeboat with a Bengal tiger.", "release_date": "2012-11-21", "duration": "2:07:00", "country": "United States"},
    {"title": "The Wolf of Wall Street", "description": "A stockbroker rises to immense wealth and power, engaging in crime, corruption, and fraud, but faces the consequences of his actions.", "release_date": "2013-12-25", "duration": "3:00:00", "country": "United States"},
    {"title": "Oldboy", "description": "After being imprisoned in a cell for 15 years, a man is released and given five days to find his captor before he is imprisoned again.", "release_date": "2003-11-21", "duration": "2:00:00", "country": "South Korea"},
    {"title": "Your Name", "description": "Two teenagers who have never met but share a mysterious connection through their dreams begin to search for each other after a strange occurrence.", "release_date": "2016-08-26", "duration": "1:46:00", "country": "Japan"}
]
